Repository: DooMLooRD/Codity
Catalog: Twitter.*/src/Twitter.Services/Resources/ErrorTranslations.*.resx
Languages: pl

# DuplicateEmail
source: Email '{0}' already exists.
pl: Email '{0}' już istnieje.

# InvalidEmail
source: Email '{0}' is invalid.
pl: Email '{0}' jest niepoprawny.

# DuplicateRoleName
source: Role name '{0}' already exists.
pl: Rola '{0}' już istnieje.

# InvalidRoleName
source: Role name '{0}' is invalid.
pl: Rola '{0}' jest niepoprawna.

source: Invalid token.
pl: Niepoprawny token.

# InvalidUserName
source: User name '{0}' is invalid.
pl: Nazwa użytkownika '{0}' jest niepoprawna.

# LoginAlreadyAssociated
source: A user with this login already exists.
pl: Użytkownik z tą nazwą użytkownika już istnieje.

# PasswordMismatch
source: Incorrect password.
pl: Niepoprawne hasło.

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
pl: Hasło musi posiadać co najmniej jedną cyfrę ('0'-'9').

# PasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z').
pl: Hasło musi posiadać co najmniej jedną małą literę ('a'-'z').

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
pl: Hasło musi posiadać co najmniej jeden znak specjalny.

# PasswordRequiresUniqueChars
source: Passwords must use at least {0} different characters.
pl: Hasło musi posiadać co najmniej '{0}' różnych znaków.

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
pl: Hasło musi posiadać co najmniej jedną dużą literę ('A'-'Z').

# PasswordTooShort
source: Passwords must be at least {0} characters.
pl: Hasło musi mieć co najmniej {0} znaków.

# UserAlreadyHasPassword
source: User already has a password set.
pl: Użytkownik już posiada ustawione hasło.

# UserAlreadyInRole
source: User already in role '{0}'.
pl: Użytkownik posiada rolę '{0}'.

# UserLockoutNotEnabled
source: Lockout is not enabled for this user.
pl: Blokada jest niedostępna dla podanego użytkownika.

# UserNotInRole
source: User is not in role '{0}'.
pl: Użytkownik nie posiada roli '{0}'.

# DefaultIdentityError
source: An unknown failure has occurred.
pl: Wystąpił nieznany błąd.

source: Recovery code redemption failed.
pl: Wykorzystanie kodu odzyskiwania nie powiodło się.

# EmailNotConfirmed
source: Email is not confirmed.
pl: Email nie został potwierdzony.

# IncorrectCredentials
source: Email or password are incorrect.
pl: Email lub hasło są niepoprawne.

# UserNotFound
source: User does not exist.
pl: Użytkownik nie istnieje.

# ConfirmationTokenNotValid
source: Confirmation token is not valid.
pl: Token potwierdzający jest niepoprawny.

# EmailSendingError
source: There was an error sending an email.
pl: Wystąpił błąd podczas wysyłania maila.

# FollowNotFound
source: You are not following the user.
pl: Follow nie istnieje.

# FollowAlreadyExists
source: You are already following the user.
pl: Follow już istnieje.

# FollowersNotFound
source: There is no followers for given user.
pl: Użytkownik nie posiada followerów.

# FollowingNotFound
source: User is not following anyone.
pl: Użytkownik nikogo nie followuje.

# NotificationNotFound
source: Notification does not exist.
pl: Powiadomienie nie istnieje.
